InformationRegisters/ПериодыПроведенныхОбщихРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПериодыПроведенныхОбщихРасчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОказаниеУслуг</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлиентыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлиентыСтационара</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаУсловийПребывания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыполнениеДействийСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеДействийСтационара</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеРежима</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеСтационара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияМедсестрыСтационара</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоВечер</Name>
					<Comment>Для параметров Температурного листа определяет, утренний это или вечерний замер показателя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УсловияПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УсловияПребывания</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Полис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраховыеПолисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДвиженияВСтационаре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДвиженияВСтационаре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводМеждуПодразделениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выписка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИсполнителиВСтационаре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИсполнителиВСтационаре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполняетсяВрачом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполняетсяМедсестрой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполняетсяВрачомОтображается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийОказанияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОказанияУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКлиенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуга, не хранится на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ФормаСозданияОУВСтационаре/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	
	ФилиалТекущий = УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
	ОсновнойПрейскурант = мУчетнаяПолитика.ОсновнойПрейскурант;

	Если ЗначениеЗаполнено(Параметры.Клиент) Тогда 
		
		Клиент = Параметры.Клиент;
		ДатаПоследнегоРасчета = ПолучитьДатуПоследнегоРасчета(ФилиалТекущий,Клиент);
		
		Если ДатаПоследнегоРасчета = Неопределено Тогда
			ДатаПоступления = ПолучитьДатуПоступления(ФилиалТекущий,Клиент);
			Если ЗначениеЗаполнено(ДатаПоступления) Тогда
				НачалоПериода = НачалоДня(ДатаПоступления);
			КонецЕсли;
		Иначе
			НачалоПериода = НачалоДня(ДатаПоследнегоРасчета) + 86400;
		КонецЕсли;
		УчитыватьПервыйДень = Истина;

		ОкончаниеПериода = КонецДня(ПолучитьДатуВыписки(ФилиалТекущий,Клиент,НачалоПериода));
		
		Если НачалоПериода <> Дата(1,1,1) И ОкончаниеПериода <= НачалоПериода Тогда 
			ОкончаниеПериода = Дата(1,1,1);	
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.СписокНоменклатурыХарактеристикаНоменклатуры.Видимость = мУчетнаяПолитика.ВестиУчетПоХарактеристикам;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуПоследнегоРасчета(ФилиалТекущий,Клиент)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПериодыПроведенныхОбщихРасчетов.ДатаОкончания
	                      |ИЗ
	                      |	РегистрСведений.ПериодыПроведенныхОбщихРасчетов КАК ПериодыПроведенныхОбщихРасчетов
	                      |ГДЕ
	                      |	ПериодыПроведенныхОбщихРасчетов.Клиент = &Клиент
	                      |	И ПериодыПроведенныхОбщихРасчетов.Филиал = &Филиал
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПериодыПроведенныхОбщихРасчетов.ДатаОкончания УБЫВ");
	Запрос.УстановитьПараметр("Филиал",ФилиалТекущий);
	Запрос.УстановитьПараметр("Клиент",Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ДатаОкончания;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуПоступления(ФилиалТекущий,Клиент)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КлиентыСтационара.ДокументПоступления,
	                      |	КлиентыСтационара.ДокументПоступления.ДокументОбращения КАК ДокументОбращения,
	                      |	КлиентыСтационара.ДокументПоступления.ДатаНачала КАК ДатаНачала
	                      |ИЗ
	                      |	РегистрСведений.КлиентыСтационара КАК КлиентыСтационара
	                      |ГДЕ
	                      |	КлиентыСтационара.Клиент = &Клиент
	                      |	И КлиентыСтационара.ДокументПоступления.ВидОперации = &ВидОперации
	                      |	И КлиентыСтационара.ДокументПоступления.Филиал = &Филиал");
	Запрос.УстановитьПараметр("Филиал",ФилиалТекущий);
	Запрос.УстановитьПараметр("Клиент",Клиент);
	Запрос.УстановитьПараметр("ВидОперации",Перечисления.ВидыДвиженияВСтационаре.Поступление);
	
	ТабРез = Запрос.Выполнить().Выгрузить();
	ТабРез.Колонки.Добавить("ДатаПоступления", Новый ОписаниеТипов("Дата"));
	
	ДатаПоступления = Неопределено;
	
	Если ТабРез.Количество() <> 0 Тогда
		Для Каждого СтрокаТаблицы Из ТабРез Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДокументОбращения) Тогда
				ДатаПоступления = СтрокаТаблицы.ДокументОбращения.ДатаВремяПоступления;
				Если ЗначениеЗаполнено(ДатаПоступления) Тогда
					СтрокаТаблицы.ДатаПоступления = ДатаПоступления;
				Иначе
					СтрокаТаблицы.ДатаПоступления = СтрокаТаблицы.ДатаНачала;
				КонецЕсли;
			Иначе
				СтрокаТаблицы.ДатаПоступления = СтрокаТаблицы.ДатаНачала;
			КонецЕсли;
		КонецЦикла;
		
		ТабРез.Сортировать("ДатаПоступления УБЫВ");
		ДатаПоступления = ТабРез[0].ДатаПоступления;
	КонецЕсли;
	
	Возврат ДатаПоступления;
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуВыписки(ФилиалТекущий,Клиент, ДатаНачала)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КлиентыСтационараСрезПоследних.Период КАК ДатаВыписки
	                      |ИЗ
	                      |	РегистрСведений.КлиентыСтационара.СрезПоследних(, Клиент = &Клиент) КАК КлиентыСтационараСрезПоследних
	                      |ГДЕ
	                      |	КлиентыСтационараСрезПоследних.Выписан");
	Запрос.УстановитьПараметр("Клиент",Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий()
		И Выборка.ДатаВыписки > ДатаНачала
	Тогда 
		Возврат Выборка.ДатаВыписки;
	Иначе 
		Возврат ТекущаяДата();	
	КонецЕсли;
		
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////
//Обработка данных

&НаСервере
Процедура ЗаполнитьПоПриемам(МВТ,ТаблицаДанных)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Клиент",Клиент);
	Запрос.УстановитьПараметр("Филиал",ФилиалТекущий);
	Запрос.УстановитьПараметр("ДатаНачала",НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",ОкончаниеПериода);
	Запрос.УстановитьПараметр("Прейскурант",ОсновнойПрейскурант);		
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриемРаботы.Ссылка КАК Ссылка,
	               |	ПриемРаботы.Ссылка.Дата КАК Дата,
	               |	ПриемРаботы.Ссылка.Врач КАК Врач,
	               |	ПриемРаботы.Номенклатура КАК Номенклатура,
	               |	ПриемРаботы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПриемРаботы.Количество КАК Количество
	               |ПОМЕСТИТЬ ТаблицаПрием
	               |ИЗ
	               |	Документ.Прием.Работы КАК ПриемРаботы
	               |ГДЕ
	               |	ПриемРаботы.Ссылка.УчитываетсяВОбщемРасчете
	               |	И ПриемРаботы.Ссылка.Клиент = &Клиент
	               |	И ПриемРаботы.Ссылка.Филиал = &Филиал
	               |	И ПриемРаботы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	тбУсловияПребывания.тзНачалоПериода КАК тзНачалоПериода,
	               |	тбУсловияПребывания.тзОкончаниеПериода КАК тзОкончаниеПериода,
	               |	тбУсловияПребывания.тзДляРасчета КАК тзДляРасчета,
	               |	тбУсловияПребывания.Регистратор КАК Регистратор,
	               |	тбУсловияПребывания.Период КАК Период,
	               |	тбУсловияПребывания.Прейскурант КАК Прейскурант,
	               |	тбУсловияПребывания.Полис КАК Полис
	               |ПОМЕСТИТЬ тбУсловияПребыванияСв
	               |ИЗ
	               |	тбУсловияПребывания КАК тбУсловияПребывания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(тбУсловияПребывания.Прейскурант, &Прейскурант) КАК Прейскурант,
	               |	ЕСТЬNULL(тбУсловияПребывания.Полис, ЗНАЧЕНИЕ(Справочник.СтраховыеПолисы.ПустаяСсылка)) КАК Полис,
	               |	Прием.Ссылка КАК Прием,
	               |	Прием.Врач КАК Врач,
	               |	Прием.Номенклатура КАК Номенклатура,
	               |	Прием.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК ЕдиницаИзмерения,
	               |	Прием.Количество КАК Количество
	               |ИЗ
	               |	ТаблицаПрием КАК Прием
	               |		ЛЕВОЕ СОЕДИНЕНИЕ тбУсловияПребыванияСв КАК тбУсловияПребывания
	               |		ПО Прием.Дата >= тбУсловияПребывания.тзНачалоПериода
	               |			И Прием.Дата <= тбУсловияПребывания.тзОкончаниеПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ тбУсловияПребыванияСв";
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивПриемов = Новый Массив;
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),Выборка);
		МассивПриемов.Добавить(Выборка.Прием);
	КонецЦикла;
	
	ЗаполнитьМатериалыПоПриемам(МассивПриемов);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДействиям(МВТ,ТаблицаДанных)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Клиент",Клиент);
	Запрос.УстановитьПараметр("Филиал",ФилиалТекущий);
	Запрос.УстановитьПараметр("ДатаНачала",НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",ОкончаниеПериода);
	Запрос.УстановитьПараметр("Прейскурант",ОсновнойПрейскурант);		
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ВыполнениеДействийСтационара.ДействиеСтационара ССЫЛКА Справочник.ДействияМедсестрыСтационара
	               |			ТОГДА ВыполнениеДействийСтационара.ДействиеСтационара.Номенклатура
	               |		ИНАЧЕ ВыполнениеДействийСтационара.ДействиеСтационара
	               |	КОНЕЦ КАК Номенклатура,
	               |	ВыполнениеДействийСтационара.Количество КАК Количество,
	               |	ВыполнениеДействийСтационара.ДатаВремяВыполнения КАК Период,
	               |	ВыполнениеДействийСтационара.Регистратор.Ответственный.Сотрудник КАК Врач,
	               |	ВыполнениеДействийСтационара.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ВыполнениеДействийСтационара.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ПОМЕСТИТЬ ТаблицаНоменклатурыПоДействиям
	               |ИЗ
	               |	РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
	               |ГДЕ
	               |	ВыполнениеДействийСтационара.Клиент = &Клиент
	               |	И ВыполнениеДействийСтационара.Регистратор.Филиал = &Филиал
	               |	И ВыполнениеДействийСтационара.ДатаВремяВыполнения МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И (ВыполнениеДействийСтационара.ДействиеСтационара ССЫЛКА Справочник.Номенклатура
	               |			ИЛИ ВЫРАЗИТЬ(ВыполнениеДействийСтационара.ДействиеСтационара КАК Справочник.ДействияМедсестрыСтационара).Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
				   |	И (НЕ ВыполнениеДействийСтационара.ДействиеСтационара ССЫЛКА Справочник.Номенклатура
				   |			ИЛИ ВыполнениеДействийСтационара.ДействиеСтационара.ИсполнительВСтационаре = ЗНАЧЕНИЕ(Перечисление.ИсполнителиВСтационаре.ВыполняетсяМедсестрой))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	тбУсловияПребывания.тзНачалоПериода КАК тзНачалоПериода,
	               |	тбУсловияПребывания.тзОкончаниеПериода КАК тзОкончаниеПериода,
	               |	тбУсловияПребывания.тзДляРасчета КАК тзДляРасчета,
	               |	тбУсловияПребывания.Регистратор КАК Регистратор,
	               |	тбУсловияПребывания.Период КАК Период,
	               |	тбУсловияПребывания.Прейскурант КАК Прейскурант,
	               |	тбУсловияПребывания.Полис КАК Полис
	               |ПОМЕСТИТЬ тбУсловияПребыванияСв
	               |ИЗ
	               |	тбУсловияПребывания КАК тбУсловияПребывания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(тбУсловияПребывания.Прейскурант, &Прейскурант) КАК Прейскурант,
	               |	ЕСТЬNULL(тбУсловияПребывания.Полис, ЗНАЧЕНИЕ(Справочник.СтраховыеПолисы.ПустаяСсылка)) КАК Полис,
	               |	ТаблицаСводная.Врач КАК Врач,
	               |	ТаблицаСводная.Номенклатура КАК Номенклатура,
	               |	ТаблицаСводная.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ТаблицаСводная.Количество КАК Количество,
	               |	ТаблицаСводная.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	ТаблицаНоменклатурыПоДействиям КАК ТаблицаСводная
	               |		ЛЕВОЕ СОЕДИНЕНИЕ тбУсловияПребыванияСв КАК тбУсловияПребывания
	               |		ПО (ТаблицаСводная.Период МЕЖДУ тбУсловияПребывания.тзНачалоПериода И тбУсловияПребывания.тзОкончаниеПериода)
	               |ГДЕ
	               |	ТаблицаСводная.Количество > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ тбУсловияПребыванияСв";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),Выборка);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУсловиям(МВТ,ТаблицаДанных)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("Клиент",Клиент);
	Запрос.УстановитьПараметр("Филиал",ФилиалТекущий);
	Запрос.УстановитьПараметр("ДатаВыписки",ДатаВыписки);
	Запрос.УстановитьПараметр("ДатаНачала",НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",ОкончаниеПериода);
	Запрос.УстановитьПараметр("Прейскурант",ОсновнойПрейскурант);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	тбУсловияПребывания.Прейскурант,
	               |	тбУсловияПребывания.Полис,
	               |	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Врач,
	               |	тбУсловияПребывания.Номенклатура,
	               |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	               |	СУММА(тбУсловияПребывания.тзДляРасчета) КАК Количество,
	               |	ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК ЕдиницаИзмерения
	               |ИЗ
	               |	тбУсловияПребывания КАК тбУсловияПребывания
	               |ГДЕ
	               |	тбУсловияПребывания.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	тбУсловияПребывания.Прейскурант,
	               |	тбУсловияПребывания.Полис,
	               |	тбУсловияПребывания.Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),Выборка);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧПоУслугам(ТаблицаДанных)
	
	ВрачПоУмолчанию = МедицинскаяДеятельностьКОРП.ПолучитьПараметрМедДеятельности("ВрачПоУмолчаниюСтационара");
	
	ТаблицаДанных.Свернуть("Прейскурант, Полис, Врач, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения","Количество");
	
	Если ТаблицаДанных.Количество() > 0 Тогда 
		СписокНоменклатуры.Очистить();
		Для Каждого стрТ Из ТаблицаДанных Цикл 
			НоваяСтрока = СписокНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТ);
			НоваяСтрока.Цена = Ценообразование.ПолучитьЦену(НоваяСтрока.Прейскурант, НоваяСтрока.Номенклатура,ТекущаяДата(), НоваяСтрока.ХарактеристикаНоменклатуры, НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков).Цена;	
			НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
			Если Не ЗначениеЗаполнено(НоваяСтрока.Врач) Тогда
				НоваяСтрока.Врач = ВрачПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоПриемам(МассивПриемов)
	
	СписокМатериалов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриемМатериалы.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА ПриемМатериалы.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	               |			ТОГДА ПриемМатериалы.Ссылка.СкладМатериалов
	               |		ИНАЧЕ ПриемМатериалы.Склад
	               |	КОНЕЦ КАК Склад,
	               |	ПриемМатериалы.Работа КАК Работа,
	               |	ПриемМатериалы.Номенклатура КАК Номенклатура,
	               |	ПриемМатериалы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПриемМатериалы.Количество КАК Количество,
	               |	ПриемМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПриемМатериалы.Коэффициент КАК Коэффициент,
	               |	ПриемМатериалы.ВходитВСтоимость КАК ВходитВСтоимость,
	               |	ПриемМатериалы.СерияНоменклатуры КАК СерияНоменклатуры
	               |ИЗ
	               |	Документ.Прием.Материалы КАК ПриемМатериалы
	               |ГДЕ
	               |	ПриемМатериалы.Ссылка В(&МассивПриемов)";
	
	Запрос.УстановитьПараметр("МассивПриемов", МассивПриемов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокМатериалов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если Не Выборка.ВходитВСтоимость Тогда 
			НоваяСтрока.Цена = Ценообразование.ПолучитьЦену(ОсновнойПрейскурант, НоваяСтрока.Номенклатура,ТекущаяДата(), НоваяСтрока.ХарактеристикаНоменклатуры, НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков).Цена;	
			НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;	
		КонецЕсли;
	КонецЦикла;  
		
КонецПроцедуры

&НаСервере 
Процедура СоздатьДокументыОУПоПриемам(мсДокументов, ТаблицаОУ);
	
	ДокументОУ = Документы.ОказаниеУслуг.ПустаяСсылка();
	СообщениеПользователю = Новый СообщениеПользователю;
	
	ТаблицаПП = ТаблицаОУ.Скопировать();
	ТаблицаПП.Свернуть("Прейскурант,Полис");
	МассивДанных = Новый Массив;
	мсПриемы = Новый Массив;

	Комментарий = "Расчет за период с " + Формат(НачалоПериода,"ДЛФ=") + " по " + Формат(ОкончаниеПериода,"ДЛФ=");

	Если ТаблицаПП.Количество() > 0 Тогда 
		Для Каждого стрПП Из ТаблицаПП Цикл 
	
			стрПриемов = ТаблицаОУ.НайтиСтроки(Новый Структура("Прейскурант,Полис", стрПП.Прейскурант,стрПП.Полис));
			Если стрПриемов.Количество() > 0 Тогда 
				Для Каждого эл Из стрПриемов Цикл 
					мсПриемы.Добавить(эл.Прием);
				КонецЦикла;
			КонецЕсли;
			МассивДанных.Добавить(Новый Структура("Клиент,Прейскурант,Полис,Комментарий,мсПриемы",Клиент,стрПП.Прейскурант,стрПП.Полис,Комментарий,мсПриемы));

			НовоеОУ = Документы.ОказаниеУслуг.СоздатьДокумент();
			НовоеОУ.Заполнить(МассивДанных);
			РаботаСДокументамиКлиентСервер.РасчитатьСуммуДокументаОказанияУслуг(НовоеОУ);
			
			Если НовоеОУ.Работы.Количество() > 0 Тогда 
				//Попытка 
				//	НовоеОУ.Записать(РежимЗаписиДокумента.Проведение);
				//	ДокументОУ = НовоеОУ.Ссылка;
				//Исключение
					Попытка
						НовоеОУ.Записать(РежимЗаписиДокумента.Запись);
						ДокументОУ = НовоеОУ.Ссылка;
						//СообщениеПользователю.Текст = "Документ оказания услуг не проведен!";
					Исключение
						СообщениеПользователю.Текст = "Не удалось записать документ оказания услуг!";
					КонецПопытки;
				//КонецПопытки;
				Иначе 
					СообщениеПользователю.Текст = "Не удалось записать услуги!";
				КонецЕсли;
				
			Если СообщениеПользователю.Текст <> "" Тогда 
				СообщениеПользователю.Сообщить();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДокументОУ) Тогда 
				мсДокументов.Добавить(ДокументОУ);
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере 
Процедура СоздатьДокументыОУ(мсДокументов, ТаблицаОУ);
	
	ДокументОУ = Документы.ОказаниеУслуг.ПустаяСсылка();
	СозданНовыйДокумент = Ложь;
	СообщениеПользователю = Новый СообщениеПользователю;
	
	ТаблицаПП = ТаблицаОУ.Скопировать();
	ТаблицаПП.Свернуть("Прейскурант,Полис");
	
	Для Каждого стрПП Из ТаблицаПП Цикл 

		СозданНовыйДокумент = Истина;
		НовоеОУ = Документы.ОказаниеУслуг.СоздатьДокумент();
		НовоеОУ.Дата = ТекущаяДата();
		НовоеОУ.Филиал = ФилиалТекущий;
		
		НовоеОУ.ВидОперации = Перечисления.ВидыОперацийОказанияУслуг.ПродажаКлиенту;
		НовоеОУ.Документ = стрПП.Полис;
		НовоеОУ.Клиент = Клиент;
		НовоеОУ.Касса = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(,"ОсновнаяКасса");
		НовоеОУ.Прейскурант = стрПП.Прейскурант;
		НовоеОУ.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		НовоеОУ.Комментарий = "Расчет за период с " + Формат(НачалоПериода,"ДЛФ=") + " по " + Формат(ОкончаниеПериода,"ДЛФ=");
		
		ВыборкаУслуги = ТаблицаОУ.НайтиСтроки(Новый Структура("Прейскурант,Полис", стрПП.Прейскурант,стрПП.Полис));
		Если ВыборкаУслуги.Количество() > 0 Тогда 
			Для Каждого Эл Из ВыборкаУслуги Цикл 
				
				Если Эл.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
					НоваяСтрока = НовоеОУ.Работы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Эл);
					СтрокиМатериалов = СписокМатериалов.НайтиСтроки(Новый Структура("Работа, Распределен", НоваяСтрока.Номенклатура, Ложь));
					Для Каждого СтрокаМатериала Из СтрокиМатериалов Цикл
						НоваяСтрокаМатериала = НовоеОУ.Материалы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаМатериала, СтрокаМатериала);
						НоваяСтрокаМатериала.КлючСтрокиРаботы = НоваяСтрока.КлючСтроки;
						СтрокаМатериала.Распределен = Истина;
						НовоеОУ.РучнаяКорректировкаМатериалов = Истина;
					КонецЦикла;
				Иначе
					НоваяСтрока = НовоеОУ.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Эл);
					Если Не ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) Тогда
						НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
					КонецЕсли;
					НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
					НоваяСтрока.БезСкладскогоУчета = Истина;
				КонецЕсли;
				
				НоваяСтрока.Цена = Эл.Цена;
				НоваяСтрока.Сумма = Эл.Количество * НоваяСтрока.Цена;
				НоваяСтрока.КлючСтроки = НоваяСтрока.НомерСтроки;
				НоваяСтрока.Сотрудник = Эл.Врач;
				
				Если ЗначениеЗаполнено(НоваяСтрока.Сотрудник)
					И Не ЗначениеЗаполнено(НовоеОУ.Сотрудник)
				Тогда
					НовоеОУ.Сотрудник = НоваяСтрока.Сотрудник;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		РаботаСДокументамиКлиентСервер.РасчитатьСуммуДокументаОказанияУслуг(НовоеОУ);

		Если НовоеОУ.Работы.Количество() > 0 Тогда 
			//Попытка 
			//	НовоеОУ.Записать(РежимЗаписиДокумента.Проведение);
			//	ДокументОУ = НовоеОУ.Ссылка;
			//Исключение
				Попытка
					НовоеОУ.Записать(РежимЗаписиДокумента.Запись);
					ДокументОУ = НовоеОУ.Ссылка;
					//СообщениеПользователю.Текст = "Документ оказания услуг не проведен!";
				Исключение
					СообщениеПользователю.Текст = "Не удалось записать документ оказания услуг!";
				КонецПопытки;
			//КонецПопытки;
		Иначе 
			СообщениеПользователю.Текст = "Не удалось записать услуги!";
		КонецЕсли;
			
		Если СообщениеПользователю.Текст <> "" Тогда 
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументОУ) И СозданНовыйДокумент Тогда 
			мсДокументов.Добавить(ДокументОУ);
		КонецЕсли;
			
	КонецЦикла;
	
	// После распределения материалов снимаем флаг
	Для Каждого СтрокаМатериалов Из СписокМатериалов Цикл
		СтрокаМатериалов.Распределен = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОказанныеУслуги(Команда)
	
	СоздатьОУ = Истина;
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда 
		Предупреждение("Для создания документов выберите клиента");
		СоздатьОУ = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда 
		Предупреждение("Для создания документов укажите начало периода");
		СоздатьОУ = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОкончаниеПериода) Тогда 
		ОкончаниеПериода = ТекущаяДата();
	КонецЕсли;
	
	Если СоздатьОУ Тогда 
		Если ПроверитьНаличиеОУ() Тогда
			Ответ = Вопрос("В выбранный период уже созданы документы оказания услуг. Продолжить? ",РежимДиалогаВопрос.ОКОтмена, ,КодВозвратаДиалога.Отмена,"Создание документов оказания услуг");
			Если Ответ = КодВозвратаДиалога.ОК Тогда
				ЗаполнитьОказанныеУслугиНаСервере();
			КонецЕсли;
		Иначе 
			ЗаполнитьОказанныеУслугиНаСервере();
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеОУ()
	
	Запрос = НОвый Запрос("ВЫБРАТЬ
	                      |	ПериодыПроведенныхОбщихРасчетов.Клиент
	                      |ИЗ
	                      |	РегистрСведений.ПериодыПроведенныхОбщихРасчетов КАК ПериодыПроведенныхОбщихРасчетов
	                      |ГДЕ
	                      |	ПериодыПроведенныхОбщихРасчетов.Филиал = &Филиал
	                      |	И ПериодыПроведенныхОбщихРасчетов.Клиент = &Клиент
	                      |	И (&ДатаНачала МЕЖДУ ПериодыПроведенныхОбщихРасчетов.ДатаНачала И ПериодыПроведенныхОбщихРасчетов.ДатаОкончания
	                      |			ИЛИ &ДатаОкончания МЕЖДУ ПериодыПроведенныхОбщихРасчетов.ДатаНачала И ПериодыПроведенныхОбщихРасчетов.ДатаОкончания
	                      |			ИЛИ &ДатаНачала <= ПериодыПроведенныхОбщихРасчетов.ДатаНачала
	                      |				И &ДатаОкончания >= ПериодыПроведенныхОбщихРасчетов.ДатаОкончания)");
	Запрос.УстановитьПараметр("Филиал",ФилиалТекущий);						  
	Запрос.УстановитьПараметр("Клиент",Клиент);	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",ОкончаниеПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьРегистрПериодом(ДокументОУ)
	
	НоваяЗапись = РегистрыСведений.ПериодыПроведенныхОбщихРасчетов.СоздатьМенеджерЗаписи();
	НоваяЗапись.Филиал 		  = ФилиалТекущий;	
	НоваяЗапись.Клиент 		  = Клиент;
	НоваяЗапись.ДатаНачала 	  = НачалоПериода;
	НоваяЗапись.ДатаОкончания = ОкончаниеПериода;
	НоваяЗапись.ОказаниеУслуг = ДокументОУ;
	НоваяЗапись.Записать();
	
КонецФункции

////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	//УстановитьДатуНачалаПериода();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСписку(Команда)
	
	ЗначениеОтбора = Новый Структура("Филиал,Клиент",ФилиалТекущий,Клиент);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);

	ФормаСпискаСозданныхДокументов = ПолучитьФорму("РегистрСведений.ПериодыПроведенныхОбщихРасчетов.ФормаСписка", ПараметрыФормы, ЭтаФорма);
  	ФормаСпискаСозданныхДокументов.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОказанныеУслугиНаСервере()
	
	ТаблицаПериодов = Новый ТаблицаЗначений;
	ПодготовитьТаблицуПериодов(ТаблицаПериодов);
	
	Если ТаблицаПериодов.Количество() > 0 Тогда 

		Запрос = Новый Запрос;
		МВТ  = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТ;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаПериодов.тзНачалоПериода,
		               |	ТаблицаПериодов.тзОкончаниеПериода,
		               |	ТаблицаПериодов.тзДляРасчета
		               |ПОМЕСТИТЬ ТаблицаПериодов
		               |ИЗ
		               |	&ТаблицаПериодов КАК ТаблицаПериодов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	УсловияПребывания.Период,
		               |	УсловияПребывания.Регистратор,
		               |	УсловияПребывания.НомерСтроки,
		               |	УсловияПребывания.Активность,
		               |	УсловияПребывания.Клиент,
		               |	УсловияПребывания.Прейскурант,
		               |	УсловияПребывания.Номенклатура,
		               |	УсловияПребывания.Полис,
		               |	УсловияПребывания.ДатаНачала,
		               |	УсловияПребывания.ДатаОкончания
		               |ПОМЕСТИТЬ УсловияПребывания
		               |ИЗ
		               |	РегистрСведений.УсловияПребывания КАК УсловияПребывания
		               |ГДЕ
		               |	УсловияПребывания.Клиент = &Клиент
		               |	И УсловияПребывания.Регистратор.Филиал = &Филиал
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаПериодов.тзНачалоПериода,
		               |	ТаблицаПериодов.тзОкончаниеПериода,
		               |	ТаблицаПериодов.тзДляРасчета,
		               |	МАКСИМУМ(УсловияПребывания.Период) КАК Период
		               |ПОМЕСТИТЬ тбМаксПериод
		               |ИЗ
		               |	ТаблицаПериодов КАК ТаблицаПериодов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ УсловияПребывания КАК УсловияПребывания
		               |		ПО ТаблицаПериодов.тзОкончаниеПериода >= УсловияПребывания.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаПериодов.тзНачалоПериода,
		               |	ТаблицаПериодов.тзОкончаниеПериода,
		               |	ТаблицаПериодов.тзДляРасчета
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	тбМаксПериод.тзНачалоПериода,
		               |	тбМаксПериод.тзОкончаниеПериода,
		               |	тбМаксПериод.тзДляРасчета,
		               |	УсловияПребывания.Период,
		               |	УсловияПребывания.Регистратор,
		               |	УсловияПребывания.НомерСтроки,
		               |	УсловияПребывания.Активность,
		               |	УсловияПребывания.Клиент,
		               |	УсловияПребывания.Прейскурант,
		               |	УсловияПребывания.Номенклатура,
		               |	УсловияПребывания.Полис,
		               |	УсловияПребывания.ДатаНачала,
		               |	УсловияПребывания.ДатаОкончания
		               |ПОМЕСТИТЬ тбУсловияПребывания
		               |ИЗ
		               |	тбМаксПериод КАК тбМаксПериод
		               |		ЛЕВОЕ СОЕДИНЕНИЕ УсловияПребывания КАК УсловияПребывания
		               |		ПО тбМаксПериод.Период = УсловияПребывания.Период";
					   
		Запрос.УстановитьПараметр("ТаблицаПериодов",ТаблицаПериодов);
		Запрос.УстановитьПараметр("Клиент",Клиент);
		Запрос.УстановитьПараметр("Филиал",ФилиалТекущий);
		
		Запрос.Выполнить();
		
		ТаблицаДанных = СписокНоменклатуры.Выгрузить(Новый Массив,);
		
		ЗаполнитьПоПриемам(МВТ,ТаблицаДанных);
		ЗаполнитьПоДействиям(МВТ,ТаблицаДанных);
		ЗаполнитьПоУсловиям(МВТ,ТаблицаДанных);

		Если ТаблицаДанных.Количество() > 0 Тогда 
			ЗаполнитьТЧПоУслугам(ТаблицаДанных);
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОказанияУслуг(Команда)
	
	СоздатьОказанияУслугСервер();
	
	Если СписокОУ.Количество() <> 0 Тогда
		Состояние("Документы созданы, но не проведены. Проверьте документы перед проведением");
		Если СписокОУ.Количество() = 1 Тогда
			ОткрытьЗначение(СписокОУ[СписокОУ.Количество()-1].Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОказанияУслугСервер()
	
	Если СписокНоменклатуры.Количество() > 0 Тогда 
		мсДокументов = Новый Массив;
		
		СоздатьДокументыОУ(мсДокументов, СписокНоменклатуры.Выгрузить());
		
		Если мсДокументов.Количество() > 0 Тогда 
			СписокОУ.Очистить();
			Для Каждого эл Из мсДокументов Цикл 
				ЗаполнитьЗначенияСвойств(СписокОУ.Добавить(),эл);
				ЗаполнитьРегистрПериодом(эл);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьТаблицуПериодов(ТаблицаПериодов)
	
	Если УчитыватьПервыйДень Тогда 
		РасчетнаяДатаНачалаПериода = НачалоДня(НачалоПериода);
	Иначе 
		РасчетнаяДатаНачалаПериода = НачалоДня(НачалоПериода + 86400);
	КонецЕсли;
	
	РасчетнаяДатаОкончанияПериода = КонецДня(ОкончаниеПериода);
	
	ТаблицаПериодов.Колонки.Добавить("тзНачалоПериода",Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаПериодов.Колонки.Добавить("тзОкончаниеПериода",Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));	
	ТаблицаПериодов.Колонки.Добавить("тзДляРасчета",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
	
	НовыйДень = РасчетнаяДатаНачалаПериода;
	
	Пока НовыйДень <= РасчетнаяДатаОкончанияПериода Цикл 
		стрТЗ = ТаблицаПериодов.Добавить();
		стрТЗ.тзНачалоПериода = НачалоДня(НовыйДень);
		стрТЗ.тзОкончаниеПериода = КонецДня(НовыйДень);
		стрТЗ.тзДляРасчета = 1;
		НовыйДень = НовыйДень + 86400;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	Если УчитыватьПервыйДень Тогда 
		НачалоПериода = НачалоДня(НачалоПериода);
	Иначе 
		НачалоПериода = НачалоДня(НачалоПериода + 86400);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПериодаПриИзменении(Элемент)
	ОкончаниеПериода = КонецДня(ОкончаниеПериода);
КонецПроцедуры

&НаКлиенте
Процедура СписокОУВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Элементы.СписокОУ.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.Цена = ТекущиеДанные.Сумма / ?(ТекущиеДанные.Количество = 0, 1, ТекущиеДанные.Количество);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПрейскурантПриИзменении(Элемент)
	
	ПересчитатьЦенуУслуги(Элементы.СписокНоменклатуры.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЦенуУслуги(СтрокаНоменклатуры)
	
	Если ЗначениеЗаполнено(СтрокаНоменклатуры.Прейскурант)
		И ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура)
	Тогда
		СтрокаНоменклатуры.Цена = Ценообразование.ПолучитьЦену(СтрокаНоменклатуры.Прейскурант, СтрокаНоменклатуры.Номенклатура,ТекущаяДата(), СтрокаНоменклатуры.ХарактеристикаНоменклатуры, СтрокаНоменклатуры.ЕдиницаИзмерения).Цена;	
	Иначе
		СтрокаНоменклатуры.Цена = 0;
	КонецЕсли;
	
	СтрокаНоменклатуры.Сумма = СтрокаНоменклатуры.Количество * СтрокаНоменклатуры.Цена;
	
КонецПроцедуры
